blog-posts/2009-04-06-nothing-quite-like-org-for-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nothing quite like Org for Emacs</title>
<!-- 2015-01-07 Wed 14:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Nothing quite like Org for Emacs</h1>
<p>
April 6th, 2009 -
<a href="http://sachachua.com/blog/p/6078"><a href="http://sachachua.com/blog/p/6078">http://sachachua.com/blog/p/6078</a></a>
</p>

<p>
I've been trying lots of different Web-based GTD task managers like
<a href="http://www.rememberthemilk.com">Remember the Milk</a>,
<a href="http://www.toodledo.com">Toodledo</a>, and
<a href="http://www.gtdagenda.com">GTDAgenda</a>. I'm slowly coming to the
conclusion that there's nothing quite like <a href="http://orgmode.org/">Org
for Emacs</a>.
</p>

<p>
Here's what I like about the other services:
</p>

<ul class="org-ul">
<li>Both Remember the Milk and Toodledo have iPhone/iPod Touch
interfaces, so I can review, check off, and create tasks anywhere.
</li>
<li>All those services allow me to e-mail tasks to an address.
</li>
<li>It's easy to filter tasks by context.
</li>
<li>I can share my tasks with my assistant so that he or she can remind
me of the tasks I've scheduled for the day.
</li>
</ul>

<p>
Here's what I like about Org:
</p>

<ul class="org-ul">
<li>I can use templates and outlines to organize my tasks however I want.
</li>
<li>I can set deadlines, scheduled tasks, and prior notice easily.
</li>
<li>I can track time more finely than Toodledo can.
</li>
<li>I can use Org as an activity log.
</li>
<li>I can schedule tasks onto specific timeslots.
</li>
</ul>

<p>
Of all the options I've tried, Toodledo is closest to where I am with
Org, although it still doesn't do everything.
</p>

<p>
Some options are:
</p>

<ul class="org-ul">
<li>Use worg or develop a web-based interface for displaying tasks based
on my Org file
</li>
<li>Write code for synchronizing Org with Toodledo or RememberTheMilk,
making lots of geeks happy in the process =)
</li>
</ul>

<p>
<a href="http://img.zemanta.com/pixy.gif?x-id=91fba46e-ed29-8637-a258-ee7f1942881a">http://img.zemanta.com/pixy.gif?x-id=91fba46e-ed29-8637-a258-ee7f1942881a</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
